Revit 2027 API
FabricationNetworkChangeService.ChangeService Method
Overload List
Name | Description
ChangeService(ISet<ElementId>, Int32, Int32) |  Changes the service of the selection of fabrication parts.
ChangeService(ISet<ElementId>, Int32, Int32, Boolean) |  Changes the service of the selection of fabrication parts.
Top
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace